Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/reference.tmx
Source language: en
Languages: pl

source: If a target was included in the :keyword:`with` statement, the return value from :meth:`__enter__` is assigned to it.
pl: Jeśli cel został określony w instrukcji :keyword:`with`, wartość zwracana z metody :meth:` __enter__` jest przypisywana do niego.

source: The :keyword:`with` statement guarantees that if the :meth:`__enter__` method returns without an error, then :meth:`__exit__` will always be called. Thus, if an error occurs during the assignment to the target list, it will be treated the same as an error occurring within the suite would be. See step 6 below.
pl: Instrukcja :keyword:`with` gwarantuje, że jeśli metoda :meth:`__enter__` wraca bez błędu, to metoda :meth:`__exit__` zawsze będzie wzywana. Zatem, jeśli wystąpi błąd podczas przypisywania do docelowej listy, będzie to traktowane tak samo, jak byłby traktowany błąd występujący w bloku kodu. Patrz krok 6 poniżej.

source: The suite is executed.
pl: Bloku kodu jest wykonywany.

source: The context manager's :meth:`__exit__` method is invoked. If an exception caused the suite to be exited, its type, value, and traceback are passed as arguments to :meth:`__exit__`. Otherwise, three :const:`None` arguments are supplied.
pl: Metoda :meth:`__exit__` zarządcy kontekstu jest wywoływana. Jeśli wyjątek spowodował zakończenie bloku kodu, jego typ, wartość i ślad błędu są przekazywane jako argumenty do metody :meth:`__exit__`. W przeciwnym razie, trzy argumenty :const:`None` są dostarczane.

source: If the suite was exited due to an exception, and the return value from the :meth:`__exit__` method was false, the exception is reraised. If the return value was true, the exception is suppressed, and execution continues with the statement following the :keyword:`with` statement.
pl: Jeśli wykonanie bloku kodu zostało zakończone z powodu wyjątku, a wartość zwracana z metody :meth:`__exit__` była fałszywa, wyjątek jest ponownie zgłaszany. Jeśli wartość zwracana była prawdziwa, wyjątek jest wstrzymywany, a wykonanie jest kontynuowane po instrukcji :keyword:`with` od instrukcji następującej po niej.

source: If the suite was exited for any reason other than an exception, the return value from :meth:`__exit__` is ignored, and execution proceeds at the normal location for the kind of exit that was taken.
pl: Jeśli wykonanie bloku kodu zostało zakończone z powodu innego niż wyjątek, wartość zwracana z metody :meth:`__exit__` jest ignorowana, a program przechodzi do miejsca typowego dla tego rodzaju wyjścia, które nastąpiło.

source: With more than one item, the context managers are processed as if multiple :keyword:`with` statements were nested::
pl: Dla więcej niż jednego elementu, zarządzacze kontekstu są przetwarzane tak, jakby wiele instrukcji :keyword:`with` zostało zagnieżdżonych::

source: with A() as a, B() as b: suite
pl: with A() as a, B() as b: blok_kodu

source: is equivalent to ::
pl: jest równoważne następującemu ::

source: with A() as a: with B() as b: suite
pl: with A() as a: with B() as b: blok_kodu

source: See also
pl: Zobacz też

source: The specification, background, and examples for the Python :keyword:`with` statement.
pl: Specyfikacja, okoliczności, i przykłady dla instrukcji :keyword:`with` w języku Python.

source: Function definitions
pl: Definicje funkcji

source: A function definition defines a user-defined function object (see section :ref:`types`):
pl: Definicja funkcji definiuje obiekt funkcji zdefiniowanej przez użytkownika (zob. sekcję :ref:`typy`):

source: A function definition is an executable statement. Its execution binds the function name in the current local namespace to a function object (a wrapper around the executable code for the function). This function object contains a reference to the current global namespace as the global namespace to be used when the function is called.
pl: Definicja funkcji jest wyrażeniem wykonywalnym. Jego wykonanie wiąże nazwę funkcji w lokalnej przestrzeni nazw z obiektem funkcji (opakowaniem wokół kodu wykonywalnego dla danej funkcji). Ten obiekt funkcji zawiera odniesienie do obecnej globalnej przestrzeni nazw jako globalnej przestrzeni nazw, która ma zostać użyta, gdy funkcja będzie wywoływana.

source: The function definition does not execute the function body; this gets executed only when the function is called. [#]_
pl: Definicja funkcji nie wykonuje ciała tej funkcji, zostaje ona wykonana tylko wtedy, gdy funkcja jest wywoływana. [#]_

source: A function definition may be wrapped by one or more :term:`decorator` expressions. Decorator expressions are evaluated when the function is defined, in the scope that contains the function definition. The result must be a callable, which is invoked with the function object as the only argument. The returned value is bound to the function name instead of the function object. Multiple decorators are applied in nested fashion. For example, the following code ::
pl: Jedno lub więcej wyrażeń :term:`dekoracyjnych` może opakowywać definicję funkcji. Wyrażenia dekoracyjne obliczane są, gdy funkcja jest definiowana, w zakresie, który zawiera definicję funkcji. Wynik musi być obiektem do którego można się odwołać, który jest wywoływany z obiektem funkcji, jako jedynym argumentem. Zwracana wartość jest związana z nazwą funkcji, zamiast obiektu funkcji. Wiele dekoratorów stosuje się w zagnieżdżony sposób. Na przykład, następujący kod ::

source: When one or more parameters have the form *parameter* ``=`` *expression*, the function is said to have "default parameter values." For a parameter with a default value, the corresponding argument may be omitted from a call, in which case the parameter's default value is substituted. If a parameter has a default value, all following parameters up until the "``*``" must also have a default value --- this is a syntactic restriction that is not expressed by the grammar.
pl: Gdy jeden lub więcej parametrów mają postać *parametr* ``=`` *wyrażenie*, o funkcji mówi się, że ma "domyślne wartości parametrów." Dla parametru z wartością domyślną, odpowiadający argument może zostać pominięty w wywołaniu, w którego przypadku domyślna wartość parametru jest podstawiana. Jeśli parametr ma wartość domyślną, wszystkie następujące po niej parametry, aż do "``*``" muszą także mieć wartość domyślną --- to jest ograniczenie składniowe, które nie jest wyrażone przez gramatykę.

source: **Default parameter values are evaluated when the function definition is executed.** This means that the expression is evaluated once, when the function is defined, and that that same "pre-computed" value is used for each call. This is especially important to understand when a default parameter is a mutable object, such as a list or a dictionary: if the function modifies the object (e.g. by appending an item to a list), the default value is in effect modified. This is generally not what was intended. A way around this is to use ``None`` as the default, and explicitly test for it in the body of the function, e.g.::
pl: **Domyślne wartości parametrów są obliczane gdy definicja funkcji jest wykonywana.** Oznacza to, że wyrażenie jest wyliczane raz, gdy funkcja jest definiowana, oraz, że te same "wstępnie-wyliczone" wartości są używane dla każdego wywołania. Jest to szczególnie ważne, aby rozumieć, że kiedy domyślnym parametrem jest mutowalny obiekt, taki jak lista lub słownik: jeśli funkcja zmienia obiekt (np. przez dodanie elementu do listy), wartość domyślna jest w efekcie zmieniona. Zazwyczaj nie jest to tym co było zamierzane. Sposobem obejścia tego problemu jest użycie ``None`` jako wartości domyślnej, i wyraźne sprawdzenie tego w ciele funkcji, np.::

source: def whats_on_the_telly(penguin=None): if penguin is None: penguin = [] penguin.append("property of the zoo") return penguin
pl: def co_w_telewizji(pingwin=None): if pingwin is None: pingwin = [] pingwin.append("własność zoo") return pingwin

source: Function call semantics are described in more detail in section :ref:`calls`. A function call always assigns values to all parameters mentioned in the parameter list, either from position arguments, from keyword arguments, or from default values. If the form "``*identifier``" is present, it is initialized to a tuple receiving any excess positional parameters, defaulting to the empty tuple. If the form "``**identifier``" is present, it is initialized to a new dictionary receiving any excess keyword arguments, defaulting to a new empty dictionary. Parameters after "``*``" or "``*identifier``" are keyword-only parameters and may only be passed used keyword arguments.
pl: Składnia wywołania funkcji została opisana bardziej szczegółowo w rozdziale :ref:`wywołania`. Wywołanie funkcji zawsze przypisuje wartości do wszystkich parametrów wymienionych na liście parametrów, z argumentów pozycyjnych, z argumentów słów kluczowych, lub z wartości domyślnych. Jeśli formuła "``*identyfikator``" jest obecna, to jest inicjowana krotką odbierającą wszystkie nadmiarowe parametry pozycyjne, pasujące do pustej krotki. Jeśli formuła "``**identyfikator``" jest obecna, to jest inicjowana do nowego słownika odbierającego wszelkie nadmiarowe argumenty słów kluczowych, pasujące do nowego pustego słownika. Parametry po "``*``" lub "``*identyfikator``" są wyłącznie parametrami słów kluczowych i można im przekazywać jedynie użyte argumenty słów kluczowych.

source: Parameters may have annotations of the form "``: expression``" following the parameter name. Any parameter may have an annotation even those of the form ``*identifier`` or ``**identifier``. Functions may have "return" annotation of the form "``-> expression``" after the parameter list. These annotations can be any valid Python expression and are evaluated when the function definition is executed. Annotations may be evaluated in a different order than they appear in the source code. The presence of annotations does not change the semantics of a function. The annotation values are available as values of a dictionary keyed by the parameters' names in the :attr:`__annotations__` attribute of the function object.
pl: Parametry mogą mieć adnotacje w postaci "``: wyrażenie``" po nazwie parametru. Każdy parametr może mieć adnotację, nawet te w postaci ``*identyfikator`` lub ``**identyfikator``. Funkcje mogą mieć "zwrotną" adnotację w postaci "``-> wyrażenie``" po liście parametrów. Adnotacje te mogą być dowolnym prawidłowym wyrażeniem Pythona i są obliczane kiedy definicja funkcji jest wykonywana. Adnotacje mogą być wyliczane w innej kolejności, niż w kolejności pojawienia się w kodzie źródłowym. Obecność adnotacji nie zmienia składni funkcji. Wartości adnotacji są dostępne jako wartości słownika kluczowanego przez nazwy parametrów w atrybucie :attr:`__annotations__` obiektu funkcji.

source: It is also possible to create anonymous functions (functions not bound to a name), for immediate use in expressions. This uses lambda forms, described in section :ref:`lambda`. Note that the lambda form is merely a shorthand for a simplified function definition; a function defined in a ":keyword:`def`" statement can be passed around or assigned to another name just like a function defined by a lambda form. The ":keyword:`def`" form is actually more powerful since it allows the execution of multiple statements and annotations.
pl: Możliwe jest także, tworzenie anonimowych funkcji (funkcji nie związanych z nazwą), do bezpośredniego stosowania w wyrażeniach. Wykorzystuje się przy tym formę lambda opisaną w rozdziale :ref:`lambda`. Należy zauważyć, że formuła lambda jest jedynie skrótem uproszczonej definicja funkcji; funkcja określona w deklaracji ":keyword:`def`" może być przekazywana, lub przypisywana do innej nazwy, tak jak funkcja zdefiniowana w formie lambda. Formuła ":keyword:`def`" jest w rzeczywistości mocniejsza, ponieważ pozwala na wykonanie wielu instrukcji i adnotacji.

source: **Programmer's note:** Functions are first-class objects. A "``def``" form executed inside a function definition defines a local function that can be returned or passed around. Free variables used in the nested function can access the local variables of the function containing the def. See section :ref:`naming` for details.
pl: **Uwaga programisty:** Funkcje są obiektami pierwszej klasy. Formuła "``def``" wykonana z wnętrza definicji funkcji definiuje lokalną funkcję, która może być zwracana lub przekazywana dalej. Wolne zmienne używane w zagnieżdżonej funkcji mogą uzyskiwać dostęp do zmiennych lokalnych funkcji zawierającej definicję funkcji zagnieżdżonej. Zobacz rozdział :ref:`nazewnictwo` po więcej szczegółów.

source: Class definitions
pl: Definicje klas

source: A class definition defines a class object (see section :ref:`types`):
pl: Definicja klasy definiuje obiekt klasy (zob. sekcję :ref:`typy`):

source: A class definition is an executable statement. It first evaluates the inheritance list, if present. Each item in the inheritance list should evaluate to a class object or class type which allows subclassing. The class's suite is then executed in a new execution frame (see section :ref:`naming`), using a newly created local namespace and the original global namespace. (Usually, the suite contains only function definitions.) When the class's suite finishes execution, its execution frame is discarded but its local namespace is saved. [#]_ A class object is then created using the inheritance list for the base classes and the saved local namespace for the attribute dictionary. The class name is bound to this class object in the original local namespace.
pl: Definicja klasy jest wyrażeniem wykonywalnym. Najpierw wyliczana jest lista dziedziczenia, jeżeli takowa występuje. Każda pozycja na liście dziedziczenia powinna zwracać obiekt klasy lub typu klasy, który umożliwia rozszerzanie klasy. Rozwinięcie klasy jest następnie wykonywane w nowych ramach wykonania (zob. sekcję :ref:`nazewnictwo`), używając nowo utworzonej lokalnej przestrzeń nazw i oryginalnej globalnej przestrzeni nazw. (Zwykle, rozwinięcie zawiera tylko definicje funkcji.) Gdy rozwinięcie klasy kończy swoje wykonanie, jego rama wykonania jest odrzucana jednak jego przestrzeń nazw lokalnych jest zachowywana. [#]_ Obiekt klasy jest wówczas tworzony za pomocą listy dziedziczenia dla klas bazowych i zapisanej lokalnej przestrzeni nazw dla słownika atrybutów. Nazwa klasy jest związana z tym obiektem klasy w pierwotnej lokalnej przestrzeni nazw.

source: Classes can also be decorated; as with functions, ::
pl: Klasy mogą być również dekorowane; tak, jak w przypadku funkcji, ::

source: **Programmer's note:** Variables defined in the class definition are class variables; they are shared by instances. Instance variables can be set in a method with ``self.name = value``. Both class and instance variables are accessible through the notation "``self.name``", and an instance variable hides a class variable with the same name when accessed in this way. Class variables can be used as defaults for instance variables, but using mutable values there can lead to unexpected results. Descriptors can be used to create instance variables with different implementation details.
pl: **Uwaga programisty:** Zmienne zdefiniowane w definicji klasy są zmiennymi klasy; są dzielone pomiędzy instancjami. Zmienne instancji mogą być ustawione w metodzie w przypadku ``self.name = wartość``. Zarówno klasy, jak i zmienne instancji są dostępne przez zapis "``self.name``", i zmienna instancji ukrywa zmienną klasy, o tej samej nazwie, kiedy następuje do niej odwołanie w ten sposób. Zmienne klas mogą być używane jako domyślne dla zmiennych instancji, ale stosowanie mutowalnych wartości, może prowadzić do nieoczekiwanych wyników. Deskryptory mogą być wykorzystywane do tworzenia zmiennych instancji w przypadku różnych szczegółów implementacji.

source: :pep:`3129` - Class Decorators
pl: :pep:`3129` - Dekoratory klas

source: Class definitions, like function definitions, may be wrapped by one or more :term:`decorator` expressions. The evaluation rules for the decorator expressions are the same as for functions. The result must be a class object, which is then bound to the class name.
pl: Tak jak definicje funkcji mogą być opakowane w jedno lub więcej wyrażeń :term:`dekoracyjnych` tak samo opakowane mogą być definicje klas. Zasady ewaluacji dla wyrażeń dekoracyjnych są takie same jak dla funkcji. Wynik musi być obiektem klasy, który następnie jest dowiązywany do nazwy klasy.

source: Footnotes
pl: Przypisy

source: The exception is propagated to the invocation stack only if there is no :keyword:`finally` clause that negates the exception.
pl: Wyjątek jest propagowany na stos wywołań tylko jeśli nie występuje klauzula :keyword:`finally` negująca wyjątek.

source: Currently, control "flows off the end" except in the case of an exception or the execution of a :keyword:`return`, :keyword:`continue`, or :keyword:`break` statement.
pl: Obecnie, kontrola wykonania "płynie do końca" z wyjątkiem przypadku wykonania instrukcji :keyword:`return`, :keyword:`continue`, lub :keyword:`break` lub zgłoszenia wyjątku.

source: A string literal appearing as the first statement in the function body is transformed into the function's ``__doc__`` attribute and therefore the function's :term:`docstring`.
pl: Łańcuch znaków pojawiający się jako pierwsze wyrażenie w ciele funkcji przekształcany jest w atrybut ``__doc__`` funkcji i tym samym w jej dokumentację :term:`docstring`.

source: A string literal appearing as the first statement in the class body is transformed into the namespace's ``__doc__`` item and therefore the class's :term:`docstring`.
pl: Ciąg znaków pojawiający się jako pierwsze wyrażenie w treści klasy przekształcane jest w element ``__doc__`` przestrzeni nazw i tym samym odpowiadającą jej dokumentację :term:`docstring`.

source: Data model
pl: Model danych

source: Objects, values and types
pl: Obiekty, wartości i typy

source: :dfn:`Objects` are Python's abstraction for data. All data in a Python program is represented by objects or by relations between objects. (In a sense, and in conformance to Von Neumann's model of a "stored program computer," code is also represented by objects.)
pl: :dfn:`Obiekty` są abstrakcyjnym określeniem Pythona dla danych. Wszystkie dane w programie Pythona są reprezentowane przez obiekty lub relacje pomiędzy nimi. (W pewnym sensie, w zgodzie z modelem von Neumanna "komputera zapisanego programu," kod programu jest również reprezentowany przez obiekty.)

source: Every object has an identity, a type and a value. An object's *identity* never changes once it has been created; you may think of it as the object's address in memory. The ':keyword:`is`' operator compares the identity of two objects; the :func:`id` function returns an integer representing its identity (currently implemented as its address). An object's :dfn:`type` is also unchangeable. [#]_ An object's type determines the operations that the object supports (e.g., "does it have a length?") and also defines the possible values for objects of that type. The :func:`type` function returns an object's type (which is an object itself). The *value* of some objects can change. Objects whose value can change are said to be *mutable*; objects whose value is unchangeable once they are created are called *immutable*. (The value of an immutable container object that contains a reference to a mutable object can change when the latter's value is changed; however the container is still considered immutable, because the collection of objects it contains cannot be changed. So, immutability is not strictly the same as having an unchangeable value, it is more subtle.) An object's mutability is determined by its type; for instance, numbers, strings and tuples are immutable, while dictionaries and lists are mutable.
pl: Każdy obiekt posiada identyfikator, typ i wartość. Ów *identyfikator* obiektu nigdy nie zmienia się od momentu jego utworzenia; można traktować go, jak adres obiektu w pamięci. Operator ':keyword:`is`' porównuje identyfikatory dwóch obiektów; funkcja :func:`id` zwraca liczbę całkowitą, reprezentującą identyfikator obiektu (obecnie realizowany jako jego adres). Typ :dfn:`type` obiektu jest także niezmienialny. [#]_ Typ obiektu, określa operacje, które obiekt wspiera (na przykład "czy ma on długość?") a także określa możliwe wartości dla obiektów tego typu. Funkcja :func:`type` zwraca typ obiektu, (którym jest sam obiekt). Mogą zmieniać się *wartości* niektórych obiektów. O obiektach, których wartość może się zmieniać mówi się, że są *mutowalne*; obiekty, których wartość jest niezmienialna od momentu ich utworzenia, są nazywane *niemutowalnymi*. (Wartość obiektu niemutowalnego pojemnika, który zawiera odniesienie do obiektu mutowalnego może się zmienić, jeśli wartość tego ostatniego zostanie zmieniona; jednakże pojemnik jest nadal uważany za niemutowalny, ponieważ kolekcja obiektów, którą zawiera, nie może być zmieniona. Zatem, niemutowalność nie jest ściśle tym samym co posiadaniem niezmienialnej wartości, jest to bardziej subtelne.) Mutowalność obiektu zależy od jego rodzaju; na przykład: liczby, ciągi znaków i krotki są niemutowalne, podczas gdy słowniki i listy są mutowalne.

source: Objects are never explicitly destroyed; however, when they become unreachable they may be garbage-collected. An implementation is allowed to postpone garbage collection or omit it altogether --- it is a matter of implementation quality how garbage collection is implemented, as long as no objects are collected that are still reachable.
pl: Obiekty nigdy nie są jawnie niszczone, jednak gdy stają się nieosiągalne mogą być usuwane. Implementacja ma prawo do odroczenia czyszczenia pamięci lub pominąć je całkowicie --- jest to kwestia jakości implementacji, jak zbieranie śmieci jest realizowane, tak długo jak żadne obiekty nie są usuwane z tych które są nadal dostępne.

source: CPython currently uses a reference-counting scheme with (optional) delayed detection of cyclically linked garbage, which collects most objects as soon as they become unreachable, but is not guaranteed to collect garbage containing circular references. See the documentation of the :mod:`gc` module for information on controlling the collection of cyclic garbage. Other implementations act differently and CPython may change.
pl: CPython obecnie używa systemu zliczania odwołań z (dodatkowym) opóźnionym wykrywaniem cyklicznie powiązanych śmieci, który zbiera większość obiektów, gdy tylko staną się nieosiągalne, ale nie gwarantuje zbierania śmieci zawierającego odwołania cykliczne. Zobacz dokumentację modułu :mod:`gc` dla informacji na temat kontrolowania zbierania śmieci z cyklicznymi odwołaniami. Inne implementacje działają w różny sposób, a także i implementacja CPython może się zmienić.

source: Note that the use of the implementation's tracing or debugging facilities may keep objects alive that would normally be collectable. Also note that catching an exception with a ':keyword:`try`...\ :keyword:`except`' statement may keep objects alive.
pl: Należy pamiętać, że używanie urządzeń implementacji służących do śledzenia błędów i odpluskwiania może przechowywać uruchomione obiekty, które normalnie podlegałyby zbieraniu śmieci. Należy również zauważyć, że złapanie wyjątku z wyrażenia ':keyword:`try`...\ :keyword:`except`' może utrzymywać obiekty w ruchu.
